#ifndef COMPILER_H
#define COMPILER_H
    #include <stdint.h>
    typedef enum 单词类型{ // 大类: 关键字，标识符, 字面量, 界符, 无效词法记号
        文件结束 = -1, 空单词, 标识符, 异常单词, 注释,
        // 字面量： 数字 字符 字符串
        数字字面量, 字符字面量, 字符串字面量, 
        // 关键字/保留字 控制语句
        过程, 函数, 返回, 善后, 跳转, //流程 proc func return defer goto
        分支, 如果, 否则,  //分支 branch if else
        循环, 直到, 当, 跳出, 下一循环, //循环 for until while break continue
        // 基本数据类型 类型定义
        变量, 常量, // var const
        无类型, 逻辑型, 逻辑真, 逻辑假, // void bool true false
        自然型, 自然型8, 自然型16, 自然型32, 自然型64, //无符号整型 uint uint8 uint16 uint32 uint64
        整型, 整型8, 整型16, 整型32, 整型64, //整型 int int8 int16 int32 int64
        字符, 字符8, 字符16, 字符32, ascii字符, //字符类型 char char8 char16 char32 指定编码类型ascii
        // 构造数据类型
        类型,   // type
        结构体, 共用体, 枚举体, //构造类型 struct union enum
        字符串, // string
        // 界符，结尾有 “号” 的表示 单字符界符，或者是相同单字符的重复
        等于号, 加号, 减号, 星号, 点乘号, 叉乘号, 斜杠, 除号, 百分号, 双加号, 双减号,  //算术运算符 = + - * · × / ÷ % ++ --
        加等于, 减等于, 星等于, 点乘等于, 叉乘等于, 斜杠等于, 除等于, 百分等于,     //自算术运算符 += -= *= ·=  ÷= /= %=
        感叹等于, 双等于, 小于号, 小于等于, 大于号, 大于等于, 不等于号, 小于等于号, 大于等于号, //比较运算符 !=、==、<、<=、>、>=、≠、≤、≥
        感叹号, 逻辑非, 与号, 竖线, 逻辑与, 逻辑或, 异或, 同或, 波浪号, 杨抑号, 双小于, 双大于, //逻辑运算符 ! ￢ ¬ & | ∧ ∨ ⊕ ⊙ ~ ^ << >>
        双与号, 双竖线, 与等于, 竖线等于, 或等于,            //短路逻辑运算符 && || &= |= 
        异或等于, 同或等于, 杨抑等于, 双小于等于, 双大于等于, //自逻辑运算符⊕= ⊙= ^= <<= >>=
        交, 并,                                            //关系运算符 ∩ ∪
        属于, 不属于, 空集, 包含于, 不包含与, 真包含于,       //集合运算符 ∅ Ø ∈∊ ∉、⊂ ⊆、⊄ ⊈、⊊ ⫋、
        逗号, 下实心点, 冒号, 分号, 顿号, 下空心点,                  //中间界符 , . : ;  ，。：；、
        左圆括号, 右圆括号, 左方括号, 右方括号, 左花括号, 右花括号,    //边缘界符 （）()[]{}
        单引号, 反引号, 双引号, 左单引号, 右单引号, 左双引号, 右双引号,//引号' ` " ‘ ’ “ ” 
        // 方向符号<- <-> -> <=> => <| |> 单字符版本：←:U+2190 ↔:U+2194 →:U+2192 ⇒:U+21D2 ⇔:U+21D4
        左单箭头, 双向单箭头, 右单箭头, 双向双箭头, 右双箭头, 小于竖线, 竖线大于, 
    } 单词类型;

    typedef enum 错误码{
        没有错误,
        // 词法分析错误
        数字字面量没有实体数据,
        字符字面量孤立左单引号, 字符字面量为空, 字符字面量不明转义字符, 字符字面量无右单引号,
        字符串字面量无右双引号, 字符串字面量存在非法字符, 字符串字面量不明转义字符,
        块注释未正常结束,
        不明转义符, 
        无效单词,
        // 语法分析错误
    }错误码;

#endif